Thanks @dimuon 

Here's the test result of 0.4.1 (latest release ver).
As you can see, it is not working.
I am testing the master (0.5.0) and will update later.

## Tested 0.4.1 (latest release ver)

### Terminal execution log

*I redacted the EC_API_KEY.*

<detais>

```bash
kuni@skymac ~ % mkdir -p ~/Work/tool/terraform/deployment; cd $_
kuni@skymac deployment % wget https://github.com/elastic/terraform-provider-ec/archive/refs/tags/v0.4.1.zip
--2022-05-11 10:49:13--  https://github.com/elastic/terraform-provider-ec/archive/refs/tags/v0.4.1.zip
github.com (github.com) をDNSに問いあわせています... 52.69.186.44
github.com (github.com)|52.69.186.44|:443 に接続しています... 接続しました。
HTTP による接続要求を送信しました、応答を待っています... 302 Found
場所: https://codeload.github.com/elastic/terraform-provider-ec/zip/refs/tags/v0.4.1 [続く]
--2022-05-11 10:49:13--  https://codeload.github.com/elastic/terraform-provider-ec/zip/refs/tags/v0.4.1
codeload.github.com (codeload.github.com) をDNSに問いあわせています... 52.193.111.178
codeload.github.com (codeload.github.com)|52.193.111.178|:443 に接続しています... 接続しました。
HTTP による接続要求を送信しました、応答を待っています... 200 OK
長さ: 特定できません [application/zip]
`v0.4.1.zip' に保存中

v0.4.1.zip                            [   <=>                                                       ] 472.98K  1.15MB/s 時間 0.4s     

2022-05-11 10:49:14 (1.15 MB/s) - `v0.4.1.zip' へ保存終了 [484330]

kuni@skymac deployment % unzip v0.4.1.zip
Archive:  v0.4.1.zip
1b6b42d882ac90125e2027bf0b88af5204c456f8
   creating: terraform-provider-ec-0.4.1/
   creating: terraform-provider-ec-0.4.1/.changelog/
 extracting: terraform-provider-ec-0.4.1/.changelog/.gitkeep  
  inflating: terraform-provider-ec-0.4.1/.changelog/430.txt  
  inflating: terraform-provider-ec-0.4.1/.changelog/472.txt  
  inflating: terraform-provider-ec-0.4.1/.changelog/477.txt  
   creating: terraform-provider-ec-0.4.1/.ci/
  inflating: terraform-provider-ec-0.4.1/.ci/Makefile  
   creating: terraform-provider-ec-0.4.1/.ci/jobs/
  inflating: terraform-provider-ec-0.4.1/.ci/jobs/defaults.yml  
  inflating: terraform-provider-ec-0.4.1/.ci/jobs/elastic+terraform-provider-ec+master.yml  
  inflating: terraform-provider-ec-0.4.1/.ci/jobs/elastic+terraform-provider-ec+pull-request.yml  
  inflating: terraform-provider-ec-0.4.1/.ci/jobs/elastic+terraform-provider-ec+tag.yml  
   creating: terraform-provider-ec-0.4.1/.ci/pipelines/
  inflating: terraform-provider-ec-0.4.1/.ci/pipelines/acceptance.Jenkinsfile  
  inflating: terraform-provider-ec-0.4.1/.ci/pipelines/release.Jenkinsfile  
   creating: terraform-provider-ec-0.4.1/.ci/views/
  inflating: terraform-provider-ec-0.4.1/.ci/views/view.yml  
   creating: terraform-provider-ec-0.4.1/.github/
  inflating: terraform-provider-ec-0.4.1/.github/CODEOWNERS  
  inflating: terraform-provider-ec-0.4.1/.github/ISSUE_TEMPLATE.md  
   creating: terraform-provider-ec-0.4.1/.github/ISSUE_TEMPLATE/
  inflating: terraform-provider-ec-0.4.1/.github/ISSUE_TEMPLATE/BUG_REPORT.md  
  inflating: terraform-provider-ec-0.4.1/.github/ISSUE_TEMPLATE/FEATURE_REQUEST.md  
  inflating: terraform-provider-ec-0.4.1/.github/ISSUE_TEMPLATE/GENERIC_QUESTION.md  
  inflating: terraform-provider-ec-0.4.1/.github/PULL_REQUEST_TEMPLATE.md  
   creating: terraform-provider-ec-0.4.1/.github/workflows/
  inflating: terraform-provider-ec-0.4.1/.github/workflows/branch.yml  
  inflating: terraform-provider-ec-0.4.1/.github/workflows/changelog_generation.yml  
  inflating: terraform-provider-ec-0.4.1/.github/workflows/go.yml  
  inflating: terraform-provider-ec-0.4.1/.gitignore  
  inflating: terraform-provider-ec-0.4.1/.golangci.yaml  
  inflating: terraform-provider-ec-0.4.1/.goreleaser.yml  
  inflating: terraform-provider-ec-0.4.1/CHANGELOG.md  
  inflating: terraform-provider-ec-0.4.1/CONTRIBUTING.md  
  inflating: terraform-provider-ec-0.4.1/LICENSE  
  inflating: terraform-provider-ec-0.4.1/Makefile  
  inflating: terraform-provider-ec-0.4.1/NOTICE  
  inflating: terraform-provider-ec-0.4.1/README.md  
   creating: terraform-provider-ec-0.4.1/build/
  inflating: terraform-provider-ec-0.4.1/build/Makefile.build  
  inflating: terraform-provider-ec-0.4.1/build/Makefile.deps  
  inflating: terraform-provider-ec-0.4.1/build/Makefile.dev  
  inflating: terraform-provider-ec-0.4.1/build/Makefile.format  
  inflating: terraform-provider-ec-0.4.1/build/Makefile.lint  
  inflating: terraform-provider-ec-0.4.1/build/Makefile.release  
  inflating: terraform-provider-ec-0.4.1/build/Makefile.test  
  inflating: terraform-provider-ec-0.4.1/build/Makefile.tools  
  inflating: terraform-provider-ec-0.4.1/build/Makefile.version  
   creating: terraform-provider-ec-0.4.1/developer_docs/
  inflating: terraform-provider-ec-0.4.1/developer_docs/RELEASE.md  
   creating: terraform-provider-ec-0.4.1/docs-elastic/
  inflating: terraform-provider-ec-0.4.1/docs-elastic/index.asciidoc  
   creating: terraform-provider-ec-0.4.1/docs/
   creating: terraform-provider-ec-0.4.1/docs/data-sources/
  inflating: terraform-provider-ec-0.4.1/docs/data-sources/ec_deployment.md  
  inflating: terraform-provider-ec-0.4.1/docs/data-sources/ec_deployments.md  
  inflating: terraform-provider-ec-0.4.1/docs/data-sources/ec_stack.md  
  inflating: terraform-provider-ec-0.4.1/docs/index.md  
   creating: terraform-provider-ec-0.4.1/docs/resources/
  inflating: terraform-provider-ec-0.4.1/docs/resources/ec_deployment.md  
  inflating: terraform-provider-ec-0.4.1/docs/resources/ec_deployment_elasticsearch_keystore.md  
  inflating: terraform-provider-ec-0.4.1/docs/resources/ec_deployment_extension.md  
  inflating: terraform-provider-ec-0.4.1/docs/resources/ec_deployment_traffic_filter.md  
  inflating: terraform-provider-ec-0.4.1/docs/resources/ec_deployment_traffic_filter_association.md  
   creating: terraform-provider-ec-0.4.1/ec/
   creating: terraform-provider-ec-0.4.1/ec/acc/
  inflating: terraform-provider-ec-0.4.1/ec/acc/acc_prereq.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/datasource_deployment_basic_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/datasource_stack_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/datasource_tags_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_autoscaling_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_basic_defaults_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_basic_tags_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_basic_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_ccs_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_checks_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_compute_optimized_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_config_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_dedicated_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_destroy_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_docker_image_override_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_elasticsearch_kesytore_destroy_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_elasticsearch_kesytore_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_emptyconf_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_enterprise_search_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_extension_basic_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_extension_bundle_file_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_extension_destroy_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_extension_plugin_download_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_failed_upgrade_retry_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_fixture_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_hotwarm_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_integrations_server_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_memory_optimized_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_observability_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_observability_tpl_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_post_node_role_upgrade_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_pre_node_role_migration_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_security_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_snapshot_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_sweep_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_sweep_test_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_traffic_filter_association_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_traffic_filter_checks_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_traffic_filter_destroy_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_traffic_filter_sweep_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_traffic_filter_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/deployment_with_extension_bundle_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/acc/sweep_test.go  
   creating: terraform-provider-ec-0.4.1/ec/acc/testdata/
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/datasource_deployment_basic.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/datasource_stack_latest.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/datasource_stack_regex.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/datasource_tags.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_autoscaling_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_autoscaling_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_defaults_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_defaults_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_defaults_3.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_defaults_hw_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_defaults_hw_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_integrations_server_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_integrations_server_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_settings_config_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_settings_config_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_tags_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_tags_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_tags_3.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_tags_4.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_with_traffic_filter_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_basic_with_traffic_filter_3.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_ccs_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_ccs_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_compute_optimized_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_compute_optimized_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_dedicated_coordinating.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_dedicated_master.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_docker_image_override.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_elasticsearch_keystore_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_elasticsearch_keystore_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_elasticsearch_keystore_3.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_elasticsearch_keystore_4.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_elasticsearch_keystore_creds.json  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_emptyconfig.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_enterprise_search_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_enterprise_search_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_hotwarm_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_hotwarm_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_memory_optimized_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_memory_optimized_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_observability_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_observability_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_observability_3.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_observability_4.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_observability_tpl_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_observability_tpl_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_post_node_roles_upgrade_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_post_node_roles_upgrade_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_pre_node_roles_migration_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_pre_node_roles_migration_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_pre_node_roles_migration_3.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_security_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_security_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_snapshot_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_snapshot_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_traffic_filter_association_basic.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_traffic_filter_association_basic_update.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_traffic_filter_azure.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_traffic_filter_basic.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_traffic_filter_basic_update.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_traffic_filter_basic_update_large.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_upgrade_retry_1.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_upgrade_retry_2.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/deployment_with_extension_bundle_file.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/extension_basic.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/extension_bundle_file.tf  
  inflating: terraform-provider-ec-0.4.1/ec/acc/testdata/extension_plugin_download.tf  
   creating: terraform-provider-ec-0.4.1/ec/ecdatasource/
   creating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/datasource.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/datasource_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_apm.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_apm_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_elasticsearch.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_elasticsearch_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_enterprise_search.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_enterprise_search_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_integrations_server.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_integrations_server_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_kibana.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_kibana_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_observability.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_observability_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_tags.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_tags_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_traffic_filter.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/flatteners_traffic_filter_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/schema.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/schema_apm.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/schema_elasticsearch.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/schema_enterprise_search.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/schema_integrations_server.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentdatasource/schema_kibana.go  
   creating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentsdatasource/
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentsdatasource/datasource.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentsdatasource/datasource_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentsdatasource/expanders.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentsdatasource/expanders_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/deploymentsdatasource/schema.go  
   creating: terraform-provider-ec-0.4.1/ec/ecdatasource/stackdatasource/
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/stackdatasource/datasource.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/stackdatasource/datasource_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/stackdatasource/flatteners_apm.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/stackdatasource/flatteners_apm_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/stackdatasource/flatteners_elasticsearch.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/stackdatasource/flatteners_elasticsearch_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/stackdatasource/flatteners_enterprise_search.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/stackdatasource/flatteners_enterprise_search_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/stackdatasource/flatteners_kibana.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/stackdatasource/flatteners_kibana_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecdatasource/stackdatasource/schema.go  
   creating: terraform-provider-ec-0.4.1/ec/ecresource/
   creating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/apm_expanders.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/apm_expanders_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/apm_flatteners.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/apm_flatteners_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/create.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/delete.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/delete_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/elasticsearch_expanders.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/elasticsearch_expanders_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/elasticsearch_flatteners.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/elasticsearch_flatteners_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/elasticsearch_remote_cluster_expanders.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/elasticsearch_remote_cluster_expanders_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/enterprise_search_expanders.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/enterprise_search_expanders_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/enterprise_search_flatteners.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/enterprise_search_flatteners_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/expanders.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/expanders_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/flatteners.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/flatteners_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/import.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/import_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/integrations_server_expanders.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/integrations_server_expanders_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/integrations_server_flatteners.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/integrations_server_flatteners_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/kibana_expanders.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/kibana_expanders_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/kibana_flatteners.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/kibana_flatteners_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/observability.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/observability_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/read.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/read_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/resource.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/schema.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/schema_apm.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/schema_elasticsearch.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/schema_enteprise_search.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/schema_integrations_server.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/schema_kibana.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/schema_v0.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/stopped_resource.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/stopped_resource_test.go  
   creating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/deployment-aws-ccs.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/deployment-aws-io-optimized-extension.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/deployment-aws-io-optimized-tags.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/deployment-aws-io-optimized.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/deployment-azure-io-optimized.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/deployment-gcp-hot-warm-node_roles.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/deployment-gcp-hot-warm.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/deployment-gcp-io-optimized-autoscale.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/deployment-gcp-io-optimized.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/template-aws-cross-cluster-search-v2.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/template-aws-hot-warm-v2.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/template-aws-io-optimized-v2.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/template-ece-3.0.0-default.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testdata/template-empty.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testutil_datastruct.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testutil_func.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/testutil_func_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/traffic_filter.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/traffic_filter_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/update.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/update_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/update_traffic_rules.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/update_traffic_rules_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/deploymentresource/wait.go  
   creating: terraform-provider-ec-0.4.1/ec/ecresource/elasticsearchkeystoreresource/
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/elasticsearchkeystoreresource/create.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/elasticsearchkeystoreresource/delete.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/elasticsearchkeystoreresource/expanders.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/elasticsearchkeystoreresource/expanders_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/elasticsearchkeystoreresource/read.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/elasticsearchkeystoreresource/read_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/elasticsearchkeystoreresource/resource.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/elasticsearchkeystoreresource/schema.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/elasticsearchkeystoreresource/testutils.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/elasticsearchkeystoreresource/update.go  
   creating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/create.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/create_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/delete.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/delete_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/read.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/read_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/resource.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/schema.go  
   creating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/testdata/
 extracting: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/testdata/test_extension_bundle.json  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/testutil_datastruct.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/update.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/update_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/extensionresource/upload.go  
   creating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/create.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/delete.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/delete_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/expanders.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/expanders_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/flatteners.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/flatteners_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/read.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/read_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/resource.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/schema.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterassocresource/testutils.go  
   creating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/create.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/delete.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/delete_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/expanders.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/expanders_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/flatteners.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/flatteners_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/read.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/read_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/resource.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/schema.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/schema_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/testutils.go  
  inflating: terraform-provider-ec-0.4.1/ec/ecresource/trafficfilterresource/update.go  
   creating: terraform-provider-ec-0.4.1/ec/internal/
   creating: terraform-provider-ec-0.4.1/ec/internal/util/
  inflating: terraform-provider-ec-0.4.1/ec/internal/util/changes.go  
  inflating: terraform-provider-ec-0.4.1/ec/internal/util/changes_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/internal/util/helpers.go  
  inflating: terraform-provider-ec-0.4.1/ec/internal/util/helpers_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/internal/util/parsers.go  
  inflating: terraform-provider-ec-0.4.1/ec/internal/util/parsers_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/internal/util/set_util.go  
  inflating: terraform-provider-ec-0.4.1/ec/internal/util/set_util_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/internal/util/testutils.go  
  inflating: terraform-provider-ec-0.4.1/ec/internal/util/traffic_filter_err.go  
  inflating: terraform-provider-ec-0.4.1/ec/internal/util/traffic_filter_err_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/provider.go  
  inflating: terraform-provider-ec-0.4.1/ec/provider_config.go  
  inflating: terraform-provider-ec-0.4.1/ec/provider_config_test.go  
  inflating: terraform-provider-ec-0.4.1/ec/version.go  
   creating: terraform-provider-ec-0.4.1/examples/
  inflating: terraform-provider-ec-0.4.1/examples/README.md  
   creating: terraform-provider-ec-0.4.1/examples/deployment/
  inflating: terraform-provider-ec-0.4.1/examples/deployment/README.md  
  inflating: terraform-provider-ec-0.4.1/examples/deployment/deployment.tf  
  inflating: terraform-provider-ec-0.4.1/examples/deployment/es_settings.yaml  
  inflating: terraform-provider-ec-0.4.1/examples/deployment/outputs.tf  
   creating: terraform-provider-ec-0.4.1/examples/deployment_ccs/
  inflating: terraform-provider-ec-0.4.1/examples/deployment_ccs/README.md  
  inflating: terraform-provider-ec-0.4.1/examples/deployment_ccs/deployment.tf  
  inflating: terraform-provider-ec-0.4.1/examples/deployment_ccs/outputs.tf  
   creating: terraform-provider-ec-0.4.1/examples/deployment_ec2_instance/
  inflating: terraform-provider-ec-0.4.1/examples/deployment_ec2_instance/README.md  
  inflating: terraform-provider-ec-0.4.1/examples/deployment_ec2_instance/aws_ec2.tf  
  inflating: terraform-provider-ec-0.4.1/examples/deployment_ec2_instance/elastic_deployment.tf  
  inflating: terraform-provider-ec-0.4.1/examples/deployment_ec2_instance/provider.tf  
  inflating: terraform-provider-ec-0.4.1/examples/deployment_ec2_instance/variables.tf  
   creating: terraform-provider-ec-0.4.1/examples/deployment_with_init/
  inflating: terraform-provider-ec-0.4.1/examples/deployment_with_init/README.md  
  inflating: terraform-provider-ec-0.4.1/examples/deployment_with_init/deployment.tf  
  inflating: terraform-provider-ec-0.4.1/examples/deployment_with_init/es_config.sh  
  inflating: terraform-provider-ec-0.4.1/examples/deployment_with_init/main.tf  
  inflating: terraform-provider-ec-0.4.1/examples/deployment_with_init/provider.tf  
   creating: terraform-provider-ec-0.4.1/examples/extension_bundle/
  inflating: terraform-provider-ec-0.4.1/examples/extension_bundle/README.md  
  inflating: terraform-provider-ec-0.4.1/examples/extension_bundle/extension.tf  
   creating: terraform-provider-ec-0.4.1/examples/extension_bundle/files/
 extracting: terraform-provider-ec-0.4.1/examples/extension_bundle/files/content.json  
  inflating: terraform-provider-ec-0.4.1/examples/extension_bundle/files/content.json.zip  
  inflating: terraform-provider-ec-0.4.1/examples/extension_bundle/outputs.tf  
   creating: terraform-provider-ec-0.4.1/gen/
  inflating: terraform-provider-ec-0.4.1/gen/gen.go  
  inflating: terraform-provider-ec-0.4.1/go.mod  
  inflating: terraform-provider-ec-0.4.1/go.sum  
  inflating: terraform-provider-ec-0.4.1/main.go  
  inflating: terraform-provider-ec-0.4.1/renovate.json  
   creating: terraform-provider-ec-0.4.1/scripts/
  inflating: terraform-provider-ec-0.4.1/scripts/Makefile.help  
  inflating: terraform-provider-ec-0.4.1/scripts/changelog.tmpl  
  inflating: terraform-provider-ec-0.4.1/scripts/generate-changelog.sh  
  inflating: terraform-provider-ec-0.4.1/scripts/release-note.tmpl  
  inflating: terraform-provider-ec-0.4.1/scripts/retry.sh  
  inflating: terraform-provider-ec-0.4.1/scripts/uname_arch.sh  
  inflating: terraform-provider-ec-0.4.1/scripts/uname_arch_goreleaser.sh  
  inflating: terraform-provider-ec-0.4.1/scripts/update-provider-version.sh  
  inflating: terraform-provider-ec-0.4.1/scripts/validate_examples.sh  
kuni@skymac deployment % cd terraform-provider-ec-0.4.1 
kuni@skymac terraform-provider-ec-0.4.1 % make install

fatal: not a git repository (or any of the parent directories): .git
fatal: not a git repository (or any of the parent directories): .git
-> Generating files...
go: downloading github.com/elastic/cloud-sdk-go v1.9.0
go: downloading github.com/hashicorp/terraform-plugin-sdk/v2 v2.15.0
go: downloading github.com/hashicorp/go-hclog v1.2.0
go: downloading github.com/hashicorp/go-plugin v1.4.3
go: downloading github.com/hashicorp/terraform-plugin-go v0.9.0
go: downloading github.com/mitchellh/go-testing-interface v1.14.1
go: downloading github.com/hashicorp/go-uuid v1.0.3
go: downloading github.com/google/go-cmp v0.5.8
go: downloading github.com/hashicorp/terraform-plugin-log v0.4.0
go: downloading github.com/mitchellh/mapstructure v1.5.0
go: downloading github.com/go-openapi/runtime v0.24.0
go: downloading github.com/go-openapi/strfmt v0.21.2
go: downloading github.com/go-openapi/swag v0.21.1
go: downloading github.com/go-openapi/errors v0.20.2
go: downloading github.com/hashicorp/terraform-exec v0.16.1
go: downloading github.com/hashicorp/terraform-json v0.13.0
go: downloading github.com/zclconf/go-cty v1.10.0
go: downloading github.com/hashicorp/errwrap v1.1.0
go: downloading github.com/hashicorp/hcl/v2 v2.12.0
go: downloading github.com/go-openapi/validate v0.21.0
go: downloading golang.org/x/text v0.3.7
go: downloading github.com/hashicorp/go-version v1.4.0
go: downloading github.com/hashicorp/hc-install v0.3.1
go: downloading go.mongodb.org/mongo-driver v1.8.3
go: downloading github.com/mailru/easyjson v0.7.7
go: downloading golang.org/x/net v0.0.0-20220127200216-cd36cc0744dd
go: downloading google.golang.org/grpc v1.45.0
go: downloading github.com/vmihailenco/msgpack/v4 v4.3.12
go: downloading github.com/go-openapi/analysis v0.21.2
go: downloading github.com/go-openapi/loads v0.21.1
go: downloading github.com/go-openapi/spec v0.20.4
go: downloading google.golang.org/protobuf v1.28.0
go: downloading google.golang.org/genproto v0.0.0-20200711021454-869866162049
go: downloading github.com/hashicorp/terraform-registry-address v0.0.0-20210412075316-9b2996cce896
go: downloading github.com/vmihailenco/tagparser v0.1.1
go: downloading github.com/go-openapi/jsonreference v0.19.6
go: downloading github.com/go-stack/stack v1.8.1
go: downloading github.com/hashicorp/terraform-svchost v0.0.0-20200729002733-f050f53b9734
go: downloading golang.org/x/crypto v0.0.0-20210616213533-5ff15b29337e
fatal: not a git repository (or any of the parent directories): .git
fatal: not a git repository (or any of the parent directories): .git
-> Installing golint...
-> Installing go-licenser...
-> Installing golangci-lint...
golangci/golangci-lint info checking GitHub for tag 'v1.40.1'
golangci/golangci-lint info found version: 1.40.1 for v1.40.1/darwin/amd64
golangci/golangci-lint info installed /Users/kuni/Work/tool/terraform/deployment/terraform-provider-ec-0.4.1/bin/golangci-lint
-> Building binary with GCFLAGS= in bin/terraform-provider-ec...
-> Copied terraform provider to ~/.terraform.d/plugins/registry.terraform.io/elastic/ec/0.4.1/darwin_amd64/terraform-provider-ec_v0.4.1
kuni@skymac terraform-provider-ec-0.4.1 % ll
total 248
-rw-r--r--   1 kuni  staff   9.6K  5 11 06:33 CHANGELOG.md
-rw-r--r--   1 kuni  staff   7.6K  5 11 06:33 CONTRIBUTING.md
-rw-r--r--   1 kuni  staff    11K  5 11 06:33 LICENSE
-rw-r--r--   1 kuni  staff   458B  5 11 06:33 Makefile
-rwxr-xr-x   1 kuni  staff   695B  5 11 06:33 NOTICE
-rw-r--r--   1 kuni  staff   4.0K  5 11 06:33 README.md
drwxr-xr-x   7 kuni  staff   224B  5 11 10:50 bin
drwxr-xr-x  11 kuni  staff   352B  5 11 06:33 build
drwxr-xr-x   3 kuni  staff    96B  5 11 06:33 developer_docs
drwxr-xr-x   5 kuni  staff   160B  5 11 06:33 docs
drwxr-xr-x   3 kuni  staff    96B  5 11 06:33 docs-elastic
drwxr-xr-x  10 kuni  staff   320B  5 11 06:33 ec
drwxr-xr-x   8 kuni  staff   256B  5 11 06:33 examples
drwxr-xr-x   3 kuni  staff    96B  5 11 06:33 gen
-rw-r--r--   1 kuni  staff   312B  5 11 06:33 go.mod
-rw-r--r--   1 kuni  staff    61K  5 11 06:33 go.sum
-rw-r--r--   1 kuni  staff   1.3K  5 11 06:33 main.go
-rw-r--r--   1 kuni  staff   173B  5 11 06:33 renovate.json
drwxr-xr-x  11 kuni  staff   352B  5 11 06:33 scripts
kuni@skymac terraform-provider-ec-0.4.1 % cd examples 
kuni@skymac examples % ll
total 8
-rw-r--r--  1 kuni  staff   443B  5 11 06:33 README.md
drwxr-xr-x  6 kuni  staff   192B  5 11 06:33 deployment
drwxr-xr-x  5 kuni  staff   160B  5 11 06:33 deployment_ccs
drwxr-xr-x  7 kuni  staff   224B  5 11 06:33 deployment_ec2_instance
drwxr-xr-x  7 kuni  staff   224B  5 11 06:33 deployment_with_init
drwxr-xr-x  6 kuni  staff   192B  5 11 06:33 extension_bundle
kuni@skymac examples % export EC_API_KEY="xxxxxx"  # ＊＊＊ Redacted＊＊＊
kuni@skymac examples % cd deployment
kuni@skymac deployment % ll
total 32
-rw-r--r--  1 kuni  staff   433B  5 11 06:33 README.md
-rw-r--r--  1 kuni  staff   940B  5 11 06:33 deployment.tf
-rw-r--r--  1 kuni  staff   152B  5 11 06:33 es_settings.yaml
-rw-r--r--  1 kuni  staff   524B  5 11 06:33 outputs.tf
kuni@skymac deployment % cat deployment.tf 
terraform {
  # The Elastic Cloud provider is supported from ">=0.12"
  # Version later than 0.12.29 is required for this terraform block to work.
  required_version = ">= 0.12.29"

  required_providers {
    ec = {
      source  = "elastic/ec"
      version = "0.4.1"
    }
  }
}

provider "ec" {}

# Retrieve the latest stack pack version
data "ec_stack" "latest" {
  version_regex = "latest"
  region        = "us-east-1"
}

# Create an Elastic Cloud deployment
resource "ec_deployment" "example_minimal" {
  # Optional name.
  name = "my_example_deployment"

  region                 = "us-east-1"
  version                = data.ec_stack.latest.version
  deployment_template_id = "aws-io-optimized-v2"

  elasticsearch {
    config {
      user_settings_yaml = file("./es_settings.yaml")
    }
  }

  kibana {}

  enterprise_search {
    topology {
      zone_count = 1
    }
  }

  apm {
    topology {
      size = "0.5g"
    }
  }
}%                                                                                                                                                                 kuni@skymac deployment % terraform init

Initializing the backend...

Initializing provider plugins...
- Finding elastic/ec versions matching "0.4.1"...
- Installing elastic/ec v0.4.1...
- Installed elastic/ec v0.4.1 (unauthenticated)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
kuni@skymac deployment % terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ec_deployment.example_minimal will be created
  + resource "ec_deployment" "example_minimal" {
      + alias                  = (known after apply)
      + apm_secret_token       = (sensitive value)
      + deployment_template_id = "aws-io-optimized-v2"
      + elasticsearch_password = (sensitive value)
      + elasticsearch_username = (known after apply)
      + id                     = (known after apply)
      + name                   = "my_example_deployment"
      + region                 = "us-east-1"
      + version                = "8.2.0"

      + apm {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-apm"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + size                      = "0.5g"
              + size_resource             = "memory"
              + zone_count                = (known after apply)
            }
        }

      + elasticsearch {
          + autoscale      = (known after apply)
          + cloud_id       = (known after apply)
          + http_endpoint  = (known after apply)
          + https_endpoint = (known after apply)
          + ref_id         = "main-elasticsearch"
          + region         = (known after apply)
          + resource_id    = (known after apply)

          + config {
              + user_settings_yaml = <<-EOT
                    # My example YAML configuration for elasicsearch nodes
                    repositories.url.allowed_urls: ["http://www.example.org/root/*", "https://*.mydomain.com/*?*#*"]
                EOT
            }

          + topology {
              + config                    = (known after apply)
              + id                        = (known after apply)
              + instance_configuration_id = (known after apply)
              + node_roles                = (known after apply)
              + node_type_data            = (known after apply)
              + node_type_ingest          = (known after apply)
              + node_type_master          = (known after apply)
              + node_type_ml              = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)

              + autoscaling {
                  + max_size             = (known after apply)
                  + max_size_resource    = (known after apply)
                  + min_size             = (known after apply)
                  + min_size_resource    = (known after apply)
                  + policy_override_json = (known after apply)
                }
            }

          + trust_account {
              + account_id      = (known after apply)
              + trust_all       = (known after apply)
              + trust_allowlist = (known after apply)
            }

          + trust_external {
              + relationship_id = (known after apply)
              + trust_all       = (known after apply)
              + trust_allowlist = (known after apply)
            }
        }

      + enterprise_search {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-enterprise_search"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + node_type_appserver       = (known after apply)
              + node_type_connector       = (known after apply)
              + node_type_worker          = (known after apply)
              + size                      = (known after apply)
              + size_resource             = "memory"
              + zone_count                = 1
            }
        }

      + kibana {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-kibana"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + size                      = (known after apply)
              + size_resource             = (known after apply)
              + zone_count                = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + elasticsearch_cloud_id       = (known after apply)
  + elasticsearch_https_endpoint = (known after apply)
  + elasticsearch_password       = (sensitive value)
  + elasticsearch_username       = (known after apply)
  + elasticsearch_version        = "8.2.0"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ec_deployment.example_minimal: Creating...
ec_deployment.example_minimal: Still creating... [10s elapsed]
ec_deployment.example_minimal: Still creating... [20s elapsed]
ec_deployment.example_minimal: Still creating... [30s elapsed]
ec_deployment.example_minimal: Still creating... [40s elapsed]
ec_deployment.example_minimal: Still creating... [50s elapsed]
ec_deployment.example_minimal: Still creating... [1m0s elapsed]
ec_deployment.example_minimal: Still creating... [1m10s elapsed]
ec_deployment.example_minimal: Still creating... [1m20s elapsed]
ec_deployment.example_minimal: Still creating... [1m30s elapsed]
ec_deployment.example_minimal: Still creating... [1m40s elapsed]
ec_deployment.example_minimal: Still creating... [1m50s elapsed]
ec_deployment.example_minimal: Still creating... [2m0s elapsed]
ec_deployment.example_minimal: Still creating... [2m10s elapsed]
ec_deployment.example_minimal: Still creating... [2m20s elapsed]
ec_deployment.example_minimal: Still creating... [2m30s elapsed]
ec_deployment.example_minimal: Still creating... [2m40s elapsed]
ec_deployment.example_minimal: Still creating... [2m50s elapsed]
ec_deployment.example_minimal: Still creating... [3m0s elapsed]
ec_deployment.example_minimal: Still creating... [3m10s elapsed]
ec_deployment.example_minimal: Still creating... [3m20s elapsed]
ec_deployment.example_minimal: Still creating... [3m30s elapsed]
ec_deployment.example_minimal: Still creating... [3m40s elapsed]
ec_deployment.example_minimal: Still creating... [3m50s elapsed]
ec_deployment.example_minimal: Still creating... [4m0s elapsed]
ec_deployment.example_minimal: Still creating... [4m10s elapsed]
ec_deployment.example_minimal: Still creating... [4m20s elapsed]
ec_deployment.example_minimal: Still creating... [4m30s elapsed]
ec_deployment.example_minimal: Still creating... [4m40s elapsed]
ec_deployment.example_minimal: Still creating... [4m50s elapsed]
ec_deployment.example_minimal: Still creating... [5m0s elapsed]
ec_deployment.example_minimal: Still creating... [5m10s elapsed]
ec_deployment.example_minimal: Still creating... [5m20s elapsed]
ec_deployment.example_minimal: Still creating... [5m30s elapsed]
ec_deployment.example_minimal: Still creating... [5m40s elapsed]
ec_deployment.example_minimal: Still creating... [5m50s elapsed]
ec_deployment.example_minimal: Still creating... [6m0s elapsed]
ec_deployment.example_minimal: Still creating... [6m10s elapsed]
ec_deployment.example_minimal: Still creating... [6m20s elapsed]
ec_deployment.example_minimal: Still creating... [6m30s elapsed]
ec_deployment.example_minimal: Still creating... [6m40s elapsed]
ec_deployment.example_minimal: Still creating... [6m50s elapsed]
ec_deployment.example_minimal: Still creating... [7m0s elapsed]
ec_deployment.example_minimal: Still creating... [7m10s elapsed]
ec_deployment.example_minimal: Still creating... [7m20s elapsed]
ec_deployment.example_minimal: Still creating... [7m30s elapsed]
ec_deployment.example_minimal: Still creating... [7m40s elapsed]
ec_deployment.example_minimal: Still creating... [7m50s elapsed]
ec_deployment.example_minimal: Still creating... [8m0s elapsed]
ec_deployment.example_minimal: Still creating... [8m10s elapsed]
ec_deployment.example_minimal: Still creating... [8m20s elapsed]
ec_deployment.example_minimal: Still creating... [8m30s elapsed]
ec_deployment.example_minimal: Still creating... [8m40s elapsed]
ec_deployment.example_minimal: Still creating... [8m50s elapsed]
ec_deployment.example_minimal: Still creating... [9m0s elapsed]
ec_deployment.example_minimal: Still creating... [9m10s elapsed]
^CStopping operation...

Interrupt received.
Please wait for Terraform to exit or data loss may occur.
Gracefully shutting down...

ec_deployment.example_minimal: Still creating... [9m20s elapsed]
ec_deployment.example_minimal: Still creating... [9m30s elapsed]
ec_deployment.example_minimal: Still creating... [9m40s elapsed]
ec_deployment.example_minimal: Still creating... [9m50s elapsed]
^C
Two interrupts received. Exiting immediately. Note that data loss may have occurred.

╷
│ Error: operation canceled
│ 
│ 
╵
```

</detais>

### Screenshot

<img width="1557" alt="image" src="https://user-images.githubusercontent.com/30574753/167754361-051fc012-91bd-4e76-bade-09aa2a866209.png">
<img width="1518" alt="image" src="https://user-images.githubusercontent.com/30574753/167754397-a2ad1411-e21b-4e93-ab32-e06b38ffc963.png">

### Deployment ID (will delete soon)

https://cloud.elastic.co/deployments/9c03945101d48d2a274141d316d8ab2d/activity/elasticsearch
